Revit 2016 API
AreaLoad.Curve Property
Returns the geometric curve within a geometric loop that defines the area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetLoops() method instead.")]
public Curve this[
	int loopIndex,
	int curveIndex
] { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetLoops() method instead.")> _
Public ReadOnly Property Curve ( _
	loopIndex As Integer, _
	curveIndex As Integer _
) As Curve
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use GetLoops() method instead.")]
public:
property Curve^ Curve[int loopIndex, int curveIndex] {
	Curve^ get (int loopIndex, int curveIndex);
}
Parameters
loopIndex
Type: System.Int32
The index of the geometric loop.
curveIndex
Type: System.Int32
The index curve within the loop.
Remarks
The loop index should be between 0 and less than NumLoops. The curve index should be between 0 and less than NumCurves(loopIndex).
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace